; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-68)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on b8 b7)
    (on b7 b14)
    (on b14 b11)
    (on b11 b6)
    (on b6 b9)
    (on b9 b12)
    (on b12 b4)
    (on b4 b19)
    (on b19 b2)
    (on b2 b10)
    (on b10 b15)
    (on b15 b13)
    (on b13 b3)
    (on b3 b1)
    (on b1 b16)
    (on b16 b5)
    (on b5 b20)
    (on b20 b17)
    (on b17 b18)
    (on-table b18))
 (:goal (and 
(on b1 b10)
))
)

; plan
1. (unstack b8 b7)
   deleted: (on b8 b7) (clear b8) (arm-empty)
   added: (holding b8) (clear b7)
   goals met: 0 of 1
2. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 1
3. (unstack b7 b14)
   deleted: (on b7 b14) (clear b7) (arm-empty)
   added: (holding b7) (clear b14)
   goals met: 0 of 1
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
5. (unstack b14 b11)
   deleted: (on b14 b11) (clear b14) (arm-empty)
   added: (holding b14) (clear b11)
   goals met: 0 of 1
6. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
7. (unstack b11 b6)
   deleted: (on b11 b6) (clear b11) (arm-empty)
   added: (holding b11) (clear b6)
   goals met: 0 of 1
8. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 1
9. (unstack b6 b9)
   deleted: (on b6 b9) (clear b6) (arm-empty)
   added: (holding b6) (clear b9)
   goals met: 0 of 1
10. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 1
11. (unstack b9 b12)
   deleted: (on b9 b12) (clear b9) (arm-empty)
   added: (holding b9) (clear b12)
   goals met: 0 of 1
12. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
13. (unstack b12 b4)
   deleted: (on b12 b4) (clear b12) (arm-empty)
   added: (holding b12) (clear b4)
   goals met: 0 of 1
14. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 1
15. (unstack b4 b19)
   deleted: (on b4 b19) (clear b4) (arm-empty)
   added: (holding b4) (clear b19)
   goals met: 0 of 1
16. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 1
17. (unstack b19 b2)
   deleted: (on b19 b2) (clear b19) (arm-empty)
   added: (holding b19) (clear b2)
   goals met: 0 of 1
18. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 1
19. (unstack b2 b10)
   deleted: (on b2 b10) (clear b2) (arm-empty)
   added: (holding b2) (clear b10)
   goals met: 0 of 1
20. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 1
21. (unstack b10 b15)
   deleted: (on b10 b15) (clear b10) (arm-empty)
   added: (holding b10) (clear b15)
   goals met: 0 of 1
22. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
23. (unstack b15 b13)
   deleted: (on b15 b13) (clear b15) (arm-empty)
   added: (holding b15) (clear b13)
   goals met: 0 of 1
24. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
25. (unstack b13 b3)
   deleted: (on b13 b3) (clear b13) (arm-empty)
   added: (holding b13) (clear b3)
   goals met: 0 of 1
26. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
27. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 0 of 1
28. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
29. (unstack b1 b16)
   deleted: (on b1 b16) (clear b1) (arm-empty)
   added: (holding b1) (clear b16)
   goals met: 0 of 1
30. (stack b1 b10)
   deleted: (clear b10) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b10)
   goals met: 1 of 1
